#1. Найдите максимум значений в словаре d = {'a':10, 'b':20, 'c':30}.
d = {'a': 10, 'b': 20, 'c': 30}
print("Исходный словарь:", d) #выводим исходник

max_value = max(d.values())
min_value = min(d.values())

print("Максимальное значение:", max_value)
print("Минимальное значение:", min_value)

print()