#1 Найдите все натуральные числа (возможно, окружённые буквами);
#2 Найдите все «слова», написанные капсом (то есть строго заглавными), возможно внутри настоящих слов (аааБББввв);
#3 Найдите слова, в которых есть русская буква, а за ней цифра;
#4 Найдите все слова, начинающиеся с русской или латинской большой буквы (\b — граница слова);
#5 Найдите слова, которые начинаются на гласную (\b — граница слова);
#6 Найдите все натуральные числа, не находящиеся на границе слова;
#7 Найдите строчки, в которых есть символ * (. — это точно не конец строки!);
#8 Найдите строчки, в которых есть открывающая и когда-нибудь потом закрывающая скобки;
#9 Выделите одним махом весь кусок оглавления (в конце примера, вместе с тегами);
#10 Выделите одним махом только текстовую часть оглавления, без тегов;
#11 Найдите пустые строчки;
#12 Найти все теги, не включая их содержимое.

#1 \d+
#2 [А-ЯЁA-Z]+
#3 \w*[А-Яа-яЁё]\d\w*
#4 \b[А-ЯЁA-Z][А-Яа-яЁёA-Za-z]*\b
#5 \b[аеёиоуыэюяАЕЁИОУЫЭЮЯaeiouAEIOU][А-Яа-яЁёA-Za-z]*\b
#6 (?<=\w)\d+(?=\w)
#7 ^.*\*.*$
#8 ^.*\(.*\).*$
#9 <ol>[\s\S]*?</ol>
#10 (?<=<li>).*?(?=</li>)
#11 ^$
#12 <[^>]*>